import React, {useEffect, useState} from 'react';
import Axios from 'axios';
import './App.css';
import { Col, Row, Form, Button } from "react-bootstrap";
import Global from './Globals.js';

function Privacy(props) {
    console.log(props)
    return (
        <div className="privacy-container">
            <button className="exit-privacy" onClick={(e)=>{Global.ShowPrivacy=false; props.toggle(); console.log(Global.ShowPrivacy)}}> X </button>
            <div className="privacy-content">
            <h3 style={{'text-align': 'center'}}> תנאי שימוש ותקנון פרטיות </h3>
                    <br />
                    <br />
                    <p dir="rtl" className="privacytxt">ברוכים הבאים לFiberLocator (להלן: &ldquo;האתר&rdquo;). האתר מופעל ע&rdquo;י אלון ברנבוים (ע.מ: 206008179) &nbsp;(להלן: &ldquo;הנהלת האתר&rdquo; או &ldquo;החברה&rdquo;).<br />האתר נועד לאפשר בדיקת אפשרות לחיבור לסיבים ע"פ כתובת בשלושה חברות במקביל - סלקום, הוט ובזק. <br /> FiberLocate זהו מיזם פרטי שאיננו מייצג את החברות הנ"ל, אשר נבנה לצורכי שימוש אישי ונועד להיות חלק מפורטפוליו של מנהל האתר להדגמת כישורים ויכולות בתחום בניית אפליקציות Web. <br /> אין בפעילותו של האתר והמיזם בכדי לפגוע בזכויותיהם של החברות המספקות את המידע למשתמש. <br /></p>
                    <ol>
                    <li dir="rtl">
                    <p dir="rtl" className="privacytxt">כללי</p>
                    <ol>
                    <li dir="rtl" className="privacytxt">
                    <p dir="rtl">האמור בתקנון זה מתייחס באופן שווה לבני שני המינים, והשימוש בלשון זכר הוא מטעמי נוחות בלבד.</p>
                    </li>
                    <li dir="rtl" className="privacytxt">
                    <p dir="rtl">הוראות תקנון זה ותנאי השימוש המופיעים באתר מגדירים את מערכת היחסים המשפטית בין המזמין לבין האתר, את תנאי השימוש באתר ו/או<br />את הזמנת המוצרים מן האתר ומעידים על הסכמת המזמין, לתנאים אלה ולתנאים נוספים המופיעים באתר.</p>
                    </li>
                    <li dir="rtl" className="privacytxt">
                    <p dir="rtl">הנהלת האתר רשאית בכל עת, על פי שיקול דעתה הבלעדי, לעדכן &nbsp;תקנון זה.</p>
                    </li>
                    <li dir="rtl" className="privacytxt">
                    <p dir="rtl">תנאים אלה חלים על השימוש באתר ובשירותים הכלולים בו באמצעות כל מחשב או מכשיר תקשורת אחר (כדוגמת טלפון סלולארי, טבלטים למיניהם וכו&rsquo;) כמו כן<br />הם חלים על השימוש באתר, בין באמצעות רשת האינטרנט ובין באמצעות כל רשת או אמצעי תקשורת אחר.</p>
                    </li>
                    <li dir="rtl" className="privacytxt">
                    <p dir="rtl">אין באמור בתקנון זה כדי לגרוע מהוראות חוק הגנת הצרכן, התשמ&rdquo;א-1981 (להלן: &ldquo;חוק הגנת הצרכן&rdquo;) והתקנות אשר הותקנו מכוחו, ככל שהן חלות על האתר<br />(להלן: &ldquo;ההוראות&rdquo;), למעט במקרים בהם ניתן להתנות על הוראות כאמור והתניה כאמור בוצעה במסגרת האתר אם במפורש ואם במשתמע.</p>
                    </li>
                    <li dir="rtl" className="privacytxt">
                    <p dir="rtl">כותרות הפרקים מובאות לשם נוחות והתמצאות המזמין ולא ישמשו בפרשנות התקנון.</p>
                    </li>
                    <li dir="rtl" className="privacytxt">
                    <p dir="rtl">אין להעתיק ולהשתמש, או לאפשר לאחרים להשתמש, בכל דרך אחרת בתכנים מתוך האתר, לרבות באתרי אינטרנט אחרים, בפרסומים אלקטרוניים,<br />בפרסומי דפוס וכיו&rdquo;ב, לכל מטרה אחרת.</p>
                    </li>
                    <li dir="rtl">
                    <p dir="rtl" className="privacytxt">המועד שנרשם, לכל עניין ועניין, במחשבי החברה הוא המועד הקובע לכל דבר.</p>
                    </li>
                    </ol>
                    </li>
                    <li dir="rtl">
                    <p dir="rtl" className="privacytxt">&nbsp;זכויות יוצרים</p>
                    <ol>
                    <li dir="rtl" className="privacytxt">
                    <p dir="rtl">כל זכויות הקניין הרוחני, לרבות פטנטים, זכויות היוצרים, הדגמים, המדגמים והסודות המסחריים, הנם רכושם של הנהלת האתר בלבד או של צדדים שלישיים אחרים שהרשו להנהלת האתר להשתמש בהם.</p>
                    </li>
                    <li dir="rtl" className="privacytxt">
                    <p dir="rtl">זכויות אלה חלות בין השאר על הנתונים באתר, ולרבות כל פרט אחר הקשור להפעלתו.</p>
                    </li>

                    <li dir="rtl">
                    <p dir="rtl" className="privacytxt">אין להעתיק, לשכפל, להפיץ, למכור, לשווק, להשכיר ולתרגם מידע כלשהו מהאתר, לרבות סימני מסחר, תמונות וטקסטים וכיו&rdquo;ב בלא קבלת אישור מראש ובכתב של החברה.</p>
                    </li>
                    </ol>
                    </li>
                    <li dir="rtl">
                    <p dir="rtl" className="privacytxt">אחריות</p>
                    <ol>
                    <li dir="rtl" className="privacytxt">
                    <p dir="rtl">החברה (ו/או מי מטעמה) אינה נושאת במישרין או בעקיפין באחריות כלשהי לנזקים הנובעים כתוצאה משימוש ו/או הסתמכות על מידע המתפרסם באתרים חיצוניים, שאליהם ניתן להגיע באמצעות איזה מהשירותים באתר. יובהר כי החברה עושה ותעשה כמיטב יכולתה לשתף פעולה עם ספקים אמינים ובעלי מוניטין בלבד.</p>
                    </li>
                    <li dir="rtl" className="privacytxt">
                    <p dir="rtl">החברה (ו/או מי מטעמה) אינה נושאת במישרין ו/או בעקיפין באחריות כלשהי לנזקים הנובעים ו/או הקשורים בכל דרך שהיא בשימוש ו/או בביצועי האתר.</p>
                    </li>
                    <li dir="rtl">
                    <p dir="rtl" className="privacytxt">בכל מקרה החברה לא תישא באחריות לפעילות כלשהי של כל גורם אחר שאינו בשליטתה המלאה.</p>
                    </li>
                    </ol>
                    </li>
                    <li dir="rtl">
                    <p dir="rtl" className="privacytxt">סודיות ופרטיות</p>
                    <ol>
                    <li dir="rtl" className="privacytxt">פרטי המשתמשים והמידע המוזן על ידיהם באתר איננו נשמר במאגרי המידע של הנהלת האתר, ומועבר לחברות התקשורות הנדונות לצורך בדיקתן. <br /> אין הנהלת האתר אחראית על המידע המועבר לחברות התקשורת, ובכוחן לעשות במידע זה כל שימוש אשר עומד בתנאי השימוש בכלי בדיקת חיבור סיבים אופטיים, אשר מופיע באתרי החברות הללו.</li>
                    <li dir="rtl">
                    <p dir="rtl" className="privacytxt">בקיום מקרים שאינם בשליטתה של הנהלת האתר ו/או הנובעים מכח עליון, הנהלת האתר לא תהא אחראית לכל נזק מכל סוג שהוא, עקיף או ישיר, שייגרם למשתמש ו/או למי מטעם המשתמש אם מידע זה יאבד או אם יעשה בו שימוש לא מורשה.</p>
                    </li>
                    </ol>
                    </li>
                    <li dir="rtl">
                    <p dir="rtl" className="privacytxt">דין ושיפוט</p>
                    <ol>
                    <li dir="rtl" className="privacytxt">
                    <p dir="rtl">הדין החל על תקנון זה ו/או על כל פעולה ו/או על סכסוך הנובע ממנו, הוא הדין הישראלי בלבד.</p>
                    </li>
                    <li dir="rtl" className="privacytxt">הדין החל על השימוש באתר, על ההזמנה ועל תקנון זה, לרבות פרשנותו ואכיפתו של התקנון הוא הדין הישראלי בלבד.</li>
                    </ol>
                    </li>
                    </ol>
                </div>
        </div>
    );
}

export default Privacy;
